# სტრინგი მარტო იმ ხაზზე იცვლება რომელზეც შეცვლი ანუ სტრინგი imutable არის
# რეპლასე ცვლის მარტო იმ ხაზზე
# არა დიქშენერის და სეტს აქვთ ერთნაირი {}
# არა სწორი არის მე დავადეკლალირე ფუნქცია
# ანუ დიდი ა და პატარა ა ერთიდა იგივე არ არი
# 2 რადგან თრუ არის 1 და თრუს + თრუ არის 2
# 100000 რასგან _ უბრალოდ დასაშორევლად არის
# ფოლსლი რადგან პითონი ცარიელ ლისტს [] ფოლსად აღიქვამს
# კი შეგვიძლია [i for i in range(10) if i % 2 == 0]
# კი შეგვიძლია [i  if i % 2 == 0 else i + 1 for i in range(10)]
# კი შეგიძლია დეკორატორები მაგას აკეთებენ შენს ფუნქციას მათში სვამენ და ამით რამდენი ხანში გაეშვება მაგასაც ზომავენ
# კი როცა 0 ვყოფთ რადგან 0 გაყოფა არ შეიძლება
# ანონიმუს ფუნქცია
# თრუს რადგან "" არის პაითონში ფოლსი და არა ფოლსი არის თრუ
# არა რადგან ყველაფერი პიტონში არის ობჯექთი და ეს უფრო კარგად ჩანდა ძველ ვერსიებაში
# არა is ოპერატორს აქვს დამატებითი მახასიათებლები
# მაღალი დონე პროგრამირების ენა ეს ნიშნავს რომ ადამიანების ენასთან ახლოს არი