# 1. ვიდეოში ცდიდნენ ხელოვნურ ინტერნეტს და რომელიც რაიმე ცუდის გაკეთებას ცდილობდა თიშავდნენ და სხვაზე გადადიოდნენ.

# 2. python-ი შეიქმნა 1991 წელს guido van rossum მიერ და python სახელი მოდის ერთი წიგნის სახელიდან (the complete monty python flying circus)
# და ასევე ბევრი ადამიანი სწავლობს python-ს რადგან მარტივი სასწავლია დამწყებებისთვის.

# 3. სასტუმროს აქვს უსასრულო ოთახები და როცა მაგ: ერთი ადამიანი შემოვა ყველა გადაიწევს ერთი ოთახით და ის ადამიანი პირველ ოთახში შევა და თუ 100 მოვა 100 გადაიწევიან.
# მაგრამ როცა მოვიდა უსასრულოდ ბებრი ადამიანი მაშინ ყველა გადავიდა თავის ოთახის ნომერზე ორჯერ დიდ ნომერში და ამით ვიცით რომ კენტი ნომერი ოთახები არის ცარიელი.
# ეხლა მოვა უსასრულოდ ბევრი ავტობუსი უსასრულოდ ბევრი ხალხით და ეხლა ესეთ რამეს აკეთებ: უნდა ავიღოთ ცხრილი სადაც ჩამოვწერთ ავტობუსებს და მივუწერთ ადგილებს.
# და სულ თავში დავწერთ ოთახებს შემდეგ ზიგზაგით მოვკიდებთ ამ ცხრილში ჩაწერილ აბტობუსში ადგილებს და სასტუმროში ადგილებს და გავშლით ამოთ მივიღებთ ერთ უსასრულო ხაზს რომელიც ჩვენ შეგვიძლია ჩავატიოთ სასტუმროში.
# ბოლოს მოვა ავტობუსი რომელშიც არიან უსასრულო ადამიანები უსასრულო სახელებით და ესენი უნდა ჩავატიოთ სახელების მიხედვით და დავიწყებთ ისევ წერას ჩვენ ცხრილში.
# ადამიანები და მათი სახელები და მივხვდებით რომ ეს შეუძლებელია რადგან ჩევენ რომ ჩავყვეთ და დავიწყოთ პირველიდან პირველი ასოს გადატრიალება (დამავიწყდა რომ მეთქვა თავში მათი სახელები A და B შედგება სხვა არაფერი).
# მაგ: თუ არის პირველი ასო A მაშინ დავწერით B და გადავალთ შემდეგი რიცხვის მეორე ასოზე ამით ჩვენ ვერასდროს ვერ მოვაზხერხებთ რომ "გამოვთვალოთ მათი რაოდენოვბა".
# და ამიტომ: ზოგი უსასრულობა სხვა უსასრულობაზე მეტია.

